app/views/comments/_comment.html.erb

INSERT INTO `comments` (`body`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('asdzxc', 2, 1, '2018-11-10 14:31:47', '2018-11-10 14:31:47')
---
	<div class="media-body">
		<h5 class="mt-0"><%= comment.user.username%> - <small><%= comment.created_at.strftime("%k:%M:%S %e.%m.%Y")%></small>