app/views/users/index.html.erb

     <tbody id="myTable">
      <% User.all.each do |user| %>
---
SELECT `users`.* FROM `users`