app/channels/comments_channel.rb

  def subscribed
    # stream_from "some_channel"
    post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1