app/views/posts/index.html.erb

        <p class="card-text"><%= post.description %>
          <a class="badge badge-warning pull-right"><%= t "posts.average" %><%= post.aver_rate %></a>
---
SELECT `posts`.* FROM `posts`