app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user
    @comment.save
---
INSERT INTO `comments` (`body`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('asd', 2, 1, '2018-11-10 13:51:22', '2018-11-10 13:51:22')

  def set_post
    @post = Post.find(params[:post_id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1