app/controllers/pages_controller.rb

  def home
  	@posts = Post.order(id: :desc).limit(3)
---
SELECT  `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC LIMIT 3