app/controllers/users_controller.rb

  def index
    if current_user && current_user.admin
      @users = User.all
---
SELECT `users`.* FROM `users`